// Напишите функцию, которая принимает два числовых аргумента a и b (a > b), и выводит в консоль числа от a до b кратные 3.
// Пример (10, 3) => 9, 6, 3

// Напишите функцию, которая суммирует числа от 0 до 100 кратные 3 или 5. Выведите сумму в консоль.

// Напишите функцию, формирующую массив из чисел от 0 до 50 кратных 5.
// => [5, 10, 15, 20, 25, 30, 35, 40, 45, 50]

// Напишите функцию, формирующую массив из чисел от a до b (b > a) кратных 2.

// Write a function that reverses a string. The input string is given as an array of characters s.
