// https:pythontutor.com/javascript.html

// от 0 до 9
for (let i = 0; i < 10; i++) {
  console.log(i); // 0 - 9
}
// --------------------------------------------------
const arr = [12, 4, 32, 34, 5, 32, 34];
for (let i = 0; i < arr.length; i++) {
  console.log(arr[i]); // 12, 4, 32, 34, 5, 32, 34
}
// --------------------------------------------------
// вывести из массива arr только положительные числа
const arr = [12, -4, 32, -34, 5, -32, 34];
for (let i = 0; i < arr.length; i++) {
  if (arr[i] >= 0) {
    console.log(arr[i]); // 12, 32, 5, 34
  }
}
// --------------------------------------------------
// перезаписали в массив индекс 2 с числом 32 на -1
const arr = [12, -4, 32, -34, 5, -32, 34];
arr[2] = -1;
console.log(arr); // 12, -4, -1, -34, 5, -32, 34;
// --------------------------------------------------
// ссылочное хронение данных
let a = [12, 32, 2];
let b = a;
b[1] = -1;
console.log(a); // [ 12, -1, 2 ]
// --------------------------------------------------
// написать цикл, который позволяет преобразовать все отрицательные числа в положительные. После цикла выведиье массив
const arr = [12, -4, 32, -34, 5, -32, 34];
for (let i = 0; i < arr.length; i++) {
  if (arr[i] < 0) {
    // arr[i] *= -1;
    arr[i] = arr[i] * -1;
  }
}
console.log(arr); // [12, 4, 32, 34, 5, 32, 34]
// исплдбзуя Math.abs()
const arr = [12, -4, 32, -34, 5, -32, 34];
for (let i = 0; i < arr.length; i++) {
  arr[i] = Math.abs(arr[i]);
}
console.log(arr); // [12, 4, 32, 34, 5, 32, 34]
// --------------------------------------------------
// написать цикл, который преобразует все нечетные числа в четные (прибовляет 1) в конце выведите массив
const arr = [12, 3, 32, 33, 5, 32, 34];
for (let i = 0; i < arr.length; i++) {
  if (arr[i] % 2 !== 0) {
    // arr[i] += 1;
    arr[i] = arr[i] + 1;
  }
}
console.log(arr); // [12, 4, 32, 34, 6, 32, 34];
// --------------------------------------------------
// написать цикл, который выводит только число, квадрат которыъ меньше 1000
const arr = [12, 3, 32, 33, 5, 32, 34];
for (let i = 0; i < arr.length; i++) {
  if (arr[i] ** 2 < 1000) {
    console.log(arr[i]); // 12, 3, 5
  }
}
// --------------------------------------------------
// найти сумму чисел их массива и вывести ее
const arr = [12, 3, 32, 33, 5, 32, 34];
let sum = 0;
for (let i = 0; i < arr.length; i++) {
  sum += arr[i];
  //   sum = sum + arr[i];
}
console.log(sum); // 151
// --------------------------------------------------
// доработать цикл таким образом, чтобы он рассчитывал сумму четных чисел
const arr = [12, 3, 32, 33, 5, 32, 34];
let sum = 0;
for (let i = 0; i < arr.length; i++) {
  if (arr[i] % 2 === 0) {
    sum += arr[i];
    //   sum = sum + arr[i];
  }
}
console.log(sum); // 110
// --------------------------------------------------
// написаить цикл (один), который находит сумму четных чисел и сумму нечетных.после цикла выведите эти значения
const arr = [12, 3, 32, 33, 5, 32, 34];
let sumEven = 0;
let sumOdd = 0;
for (let i = 0; i < arr.length; i++) {
  if (arr[i] % 2 === 0) {
    sumEven += arr[i];
  } else {
    sumOdd += arr[i];
  }
}
console.log(`Сумму четных чисел: ${sumEven}`); // Cумму четных чисел: 110
console.log(`Сумму нечетных чисел: ${sumOdd}`); // Cумму нечетных чисел: 41
// --------------------------------------------------
// найти сумму положительных чисел и отрецательных из массива использовать только один цикл сумму отрицательных чисел нужно посчетать без минуса
const arr = [12, 3, -32, 33, -5, 32, -34];
let sumPositiv = 0;
let sumNegativ = 0;
for (let i = 0; i < arr.length; i++) {
  if (arr[i] > 0) {
    sumPositiv += arr[i];
  } else {
    // sumNegativ += -arr[i];
    sumNegativ -= arr[i];
  }
}
console.log(`Сумму четных чисел: ${sumPositiv}`); // Cумму четных чисел: 80
console.log(`Сумму нечетных чисел: ${sumNegativ}`); // Cумму нечетных чисел: 71
console.log("Summ positiv: ", sumPositiv); // Summ positiv:  80
console.log("Summ Negativ: ", sumNegativ); // Summ Negativ:  71
// --------------------------------------------------
// Найти максимальное число из массива все числа в массиве положительные
const arr = [12, 3, 32, 33, 5, 32, 34];
let max = 0;
for (let i = 0; i < arr.length; i++) {
  if (arr[i] > max) {
    max = arr[i];
  }
}
console.log(max); // 34
// --------------------------------------------------
// Найти максимальное число из массива
const arr = [-12, -3, -32, -33, -5, -32, -34];
let max = arr[0];
for (let i = 0; i < arr.length; i++) {
  if (arr[i] > max) {
    max = arr[i];
  }
}
console.log(max); // -3
// --------------------------------------------------
// написать цикл, который находит индекс максимального числа если максимальных чисел: несколько, то в мы сохроняем индекс первого максимального числа
const arr = [-12, -3, -32, -33, -5, -32, -34];
let maxResalt = arr[0];
let maxIndex = 0;
for (let i = 0; i < arr.length; i++) {
  if (arr[i] > maxResalt) {
    maxResalt = arr[i];
    maxIndex = i;
  }
}
console.log(maxIndex); // 1
// --------------------------------------------------
// найти в массиве преднаибольшее число
const arr = [4, 7, 12, 11];
let maxResalt = arr[0];
let predMaxResalt = arr[0];
for (let i = 0; i < arr.length; i++) {
  if (arr[i] > maxResalt) {
    predMaxResalt = maxResalt;
    maxResalt = arr[i];
  } else if (arr[i] > predMaxResalt) {
    predMaxResalt = arr[i];
  }
}
console.log(predMaxResalt); // 11
